'use strict';

const a = prompt('Введіть число: ');
const b = prompt('Введіть число: ');

alert( +a === 0 ? 'Вірно' : 'Неправильно');
alert( +a > 0 ? 'Вірно' : 'Неправильно');
alert( +a < 0 ? 'Вірно' : 'Неправильно');
alert( +a >= 0 ? 'Вірно' : 'Неправильно');
alert( +a <= 0 ? 'Вірно' : 'Неправильно');
alert( +a !== 0 ? 'Вірно' : 'Неправильно');
alert( a === 'test' ? 'Вірно' : 'Неправильно');
alert( a === '1' ? 'Вірно' : 'Неправильно');
alert( +a > 0 && +a < 5 ? 'Вірно' : 'Неправильно');
alert( +a === 0 || +a === 2 ? `Вірно ${+a + 7}` : `Неправильно ${+a / 10}`);
alert( +a <= 1 && +b >= 3 ? `Вірно ${+a + +b}` : `Неправильно ${+a - +b}`);
alert( +a > 2 && +a < 11 || +b >= 6 && +b < 14 ? 'Вірно' : 'Неправильно');

// __________________________________________

const num = +prompt('Введіть число від 1 до 4: ');

switch (num) {
    case 1:
        alert('Зима');
        break;
    case 2:
        alert('Весна');
        break;
    case 3:
        alert('Літо');
        break;
    case 4:
        alert('Осінь')
        break;
    default:
        alert('Значення не визначено');
}
